# Rebar Free Form Accessor Get Hook Orientation Angle Method

Source: https://www.revitapidocs.com/2026/65b56092-69cf-d374-8e0f-689c91c53586.htm

---

| Rebar Free Form Accessor Get Hook Orientation Angle Method |
| --- |

**Note: This API is now obsolete.**

Get the termination's rotation angle at end.
 The angle is used for both hook and crank.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")]
public double GetHookOrientationAngle(
	int end
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")>
Public Function GetHookOrientationAngle (
	end As Integer
) As Double
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")]
double GetHookOrientationAngle(
	int end
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")>]
member GetHookOrientationAngle :
        end : int -> float
```

#### Parameters

end Int32
:   The end of bar. Should be 0 for start or 1 for end.

#### Return Value

Double
The termination's rotation angle at end.
 The angle is used for both hook and crank. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Invalid end. |

See Also

#### Reference

RebarFreeFormAccessor Class Autodesk.Revit.DB.Structure Namespace